kiffie/pic32-pac/pic32mx470/pic32mx47xfxxxl/PIC32MX470F512L.svd
        <register>
          <name>ODCACLR</name>
          <description>ODCACLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCASET</name>
          <description>ODCASET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCAINV</name>
          <description>ODCAINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUA</name>
          <description>CNPUA register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUACLR</name>
          <description>CNPUACLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUASET</name>
          <description>CNPUASET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUAINV</name>
          <description>CNPUAINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDA</name>
          <description>CNPDA register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDACLR</name>
          <description>CNPDACLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDASET</name>
          <description>CNPDASET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDAINV</name>
          <description>CNPDAINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONA</name>
          <description>CNCONA register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONACLR</name>
          <description>CNCONACLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONASET</name>
          <description>CNCONASET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONAINV</name>
          <description>CNCONAINV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENA</name>
          <description>CNENA register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIEA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
