kiffie/pic32-pac/pic32mx470/pic32mx47xfxxxl/PIC32MX470F512L.svd
        <register>
          <name>CNPUBSET</name>
          <description>CNPUBSET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPUB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUBINV</name>
          <description>CNPUBINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPUB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDB</name>
          <description>CNPDB register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPDB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDBCLR</name>
          <description>CNPDBCLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPDB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDBSET</name>
          <description>CNPDBSET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPDB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDBINV</name>
          <description>CNPDBINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPDB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONB</name>
          <description>CNCONB register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONBCLR</name>
          <description>CNCONBCLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONBSET</name>
          <description>CNCONBSET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONBINV</name>
          <description>CNCONBINV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENB</name>
          <description>CNENB register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIEB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNIEB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIEB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENBCLR</name>
          <description>CNENBCLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIEB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNIEB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIEB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENBSET</name>
          <description>CNENBSET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIEB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNIEB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIEB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENBINV</name>
          <description>CNENBINV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIEB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNIEB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIEB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
