kiffie/pic32-pac/pic32mx470/pic32mx47xfxxxl/PIC32MX470F512L.svd
        <register>
          <name>LATDSET</name>
          <description>LATDSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LATD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LATD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LATD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LATD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATDINV</name>
          <description>LATDINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LATD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LATD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LATD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LATD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCD</name>
          <description>ODCD register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ODCD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCDCLR</name>
          <description>ODCDCLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ODCD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCDSET</name>
          <description>ODCDSET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ODCD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCDINV</name>
          <description>ODCDINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ODCD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUD</name>
          <description>CNPUD register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPUD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUDCLR</name>
          <description>CNPUDCLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPUD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUDSET</name>
          <description>CNPUDSET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPUD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUDINV</name>
          <description>CNPUDINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPUD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDD</name>
          <description>CNPDD register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPDD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
