kiffie/pic32-pac/pic32mx470/pic32mx47xfxxxl/PIC32MX470F512L.svd
        <register>
          <name>CNPUFCLR</name>
          <description>CNPUFCLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUFSET</name>
          <description>CNPUFSET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUFINV</name>
          <description>CNPUFINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDF</name>
          <description>CNPDF register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDFCLR</name>
          <description>CNPDFCLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDFSET</name>
          <description>CNPDFSET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDFINV</name>
          <description>CNPDFINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONF</name>
          <description>CNCONF register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONFCLR</name>
          <description>CNCONFCLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONFSET</name>
          <description>CNCONFSET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONFINV</name>
          <description>CNCONFINV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENF</name>
          <description>CNENF register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENFCLR</name>
          <description>CNENFCLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENFSET</name>
          <description>CNENFSET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENFINV</name>
          <description>CNENFINV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATF</name>
          <description>CNSTATF register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATFCLR</name>
          <description>CNSTATFCLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATFSET</name>
          <description>CNSTATFSET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATFINV</name>
          <description>CNSTATFINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
