kiffie/pic32-pac/pic32mx470/pic32mx47xfxxxl/PIC32MX470F512L.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTG</name>
      <description>PORTG peripheral</description>
      <baseAddress>0xbf886600</baseAddress>
      <registers>
        <register>
          <name>ANSELG</name>
          <description>ANSELG register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>960</resetValue>
          <fields>
            <field>
              <name>ANSG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ANSG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ANSG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ANSG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELGCLR</name>
          <description>ANSELGCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ANSG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ANSG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ANSG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELGSET</name>
          <description>ANSELGSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ANSG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ANSG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ANSG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELGINV</name>
          <description>ANSELGINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ANSG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ANSG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ANSG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISG</name>
          <description>TRISG register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>62403</resetValue>
          <fields>
            <field>
              <name>TRISG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRISG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TRISG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TRISG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TRISG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISGCLR</name>
          <description>TRISGCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRISG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TRISG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TRISG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TRISG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISGSET</name>
          <description>TRISGSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRISG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TRISG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TRISG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TRISG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISGINV</name>
          <description>TRISGINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRISG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TRISG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TRISG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TRISG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTG</name>
          <description>PORTG register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>RG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTGCLR</name>
          <description>PORTGCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>RG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTGSET</name>
          <description>PORTGSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>RG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTGINV</name>
          <description>PORTGINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>RG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATG</name>
          <description>LATG register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LATG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LATG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATGCLR</name>
          <description>LATGCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LATG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LATG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATGSET</name>
          <description>LATGSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LATG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LATG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATGINV</name>
          <description>LATGINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LATG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LATG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCG</name>
          <description>ODCG register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCGCLR</name>
          <description>ODCGCLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
