kiffie/pic32-pac/pic32mx470/pic32mx47xfxxxl/PIC32MX470F512L.svd
        <register>
          <name>CNSTATG</name>
          <description>CNSTATG register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATGCLR</name>
          <description>CNSTATGCLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATGSET</name>
          <description>CNSTATGSET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATGINV</name>
          <description>CNSTATGINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WDT</name>
      <description>WDT peripheral</description>
      <baseAddress>0xbf800000</baseAddress>
      <registers>
        <register>
          <name>WDTCON</name>
          <description>WDTCON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WDTCLR</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>WDTWINEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SWDTPS</name>
              <bitRange>[6:2]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCONCLR</name>
          <description>WDTCONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WDTCLR</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>WDTWINEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SWDTPS</name>
              <bitRange>[6:2]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCONSET</name>
          <description>WDTCONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WDTCLR</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>WDTWINEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SWDTPS</name>
              <bitRange>[6:2]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCONINV</name>
          <description>WDTCONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WDTCLR</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>WDTWINEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SWDTPS</name>
              <bitRange>[6:2]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
