kiffie/pic32-pac/pic32mx470/pic32mx47xfxxxl/PIC32MX470F512L.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ICAP3</name>
      <description>ICAP3 peripheral</description>
      <baseAddress>0xbf802400</baseAddress>
      <registers>
        <register>
          <name>IC3CON</name>
          <description>IC3CON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ICM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>ICBNE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ICOV</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ICI</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>ICTMR</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>C32</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FEDGE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IC3CONCLR</name>
          <description>IC3CONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ICM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>ICBNE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ICOV</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ICI</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>ICTMR</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>C32</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FEDGE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IC3CONSET</name>
          <description>IC3CONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ICM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>ICBNE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ICOV</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ICI</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>ICTMR</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>C32</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FEDGE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IC3CONINV</name>
          <description>IC3CONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ICM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>ICBNE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ICOV</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ICI</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>ICTMR</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>C32</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FEDGE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IC3BUF</name>
          <description>IC3BUF register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IC3BUF</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
